labels_dict = {
    "அ": "000", "ஆ": "001", "இ": "002", "ஈ": "003", "உ": "004", "ஊ": "005", "எ": "006", "ஏ": "007", "ஐ": "008", "ஒ": "009", "ஓ": "010", "ஔ": "011",
    "க": "012", "ங": "013", "ச": "014", "ஞ": "015", "ட": "016", "ண": "017", "த": "018", "ந": "019", "ப": "020", "ம": "021", "ய": "022", "ர": "023", "ல": "024", "வ": "025", "ழ": "026", "ள": "027", "ற": "028", "ன": "029",
    "ஸ": "030", "ஷ": "031", "ஜ": "032", "ஹ": "033", "க்ஷ": "034",
    "கி": "035", "ஙி": "036", "சி": "037", "ஞி": "038", "டி": "039", "ணி": "040", "தி": "041", "நி": "042", "பி": "043", "மி": "044", "யி": "045", "ரி": "046", "லி": "047", "வி": "048", "ழி": "049", "ளி": "050", "றி": "051", "னி": "052",
    "ஸி": "053", "ஷி": "054", "ஜி": "055", "ஹி": "056", "க்ஷி": "057",
    "கீ": "058", "ஙீ": "059", "சீ": "060", "ஞீ": "061", "டீ": "062", "ணீ": "063", "தீ": "064", "நீ": "065", "பீ": "066", "மீ": "067", "யீ": "068", "ரீ": "069", "லீ": "070", "வீ": "071", "ழீ": "072", "ளீ": "073", "றீ": "074", "னீ": "075",
    "ஸீ": "076", "ஷீ": "077", "ஜீ": "078", "ஹீ": "079", "க்ஷீ": "080",
    "கு": "081", "ஙு": "082", "சு": "083", "ஞு": "084", "டு": "085", "ணு": "086", "து": "087", "நு": "088", "பு": "089", "மு": "090", "யு": "091", "ரு": "092", "லு": "093", "வு": "094", "ழு": "095", "ளு": "096", "று": "097", "னு": "098",
    "கூ": "099", "ஙூ": "100", "சூ": "101", "ஞூ": "102", "டூ": "103", "ணூ": "104", "தூ": "105", "நூ": "106", "பூ": "107", "மூ": "108", "யூ": "109", "ரூ": "110", "லூ": "111", "வூ": "112", "ழூ": "113", "ளூ": "114", "றூ": "115", "னூ": "116",
    "ா": "117", "ே": "118", "ை": "119", "ெ": "120",
    "ஸு": "121", "ஷு": "122", "ஜு": "123", "ஹு": "124", "க்ஷு": "125",
    "ஸூ": "126", "ஷூ": "127", "ஜூ": "128", "ஹூ": "129", "க்ஷூ": "130",
    "க்": "131", "ங்": "132", "ச்": "133", "ஞ்": "134", "ட்": "135", "ண்": "136", "த்": "137", "ந்": "138", "ப்": "139", "ம்": "140", "ய்": "141", "ர்": "142", "ல்": "143", "வ்": "144", "ழ்": "145", "ள்": "146", "ற்": "147", "ன்": "148",
    "ஸ்": "149", "ஷ்": "150", "ஜ்": "151", "ஹ்": "152", "க்ஷ்": "153", "ஔ": "154"
}


# Creating a reverse mapping from numbers to Tamil letters
reverse_labels = {v: k for k, v in labels.items()}

# Function to get Tamil character from predicted number
def get_tamil_character(predicted_number):
    return reverse_labels.get(predicted_number, "Unknown")
predicted_number = "143"  # Example output from model
tamil_character = get_tamil_character(predicted_number)
print("Predicted Tamil Character:", tamil_character)  # Output: அ
